
&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)  
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные;
	_Расчеты.РассчитатьСумму(ТекущиеДанныеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказЦенаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные;
	_Расчеты.РассчитатьСумму(ТекущиеДанныеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказБлюдоПриИзменении(Элемент) 
	
	ТекущиеДанныеТаблицы = Элементы.Заказ.ТекущиеДанные; 
	ТекущиеДанныеТаблицы.Цена = ПолучитьЦену(ТекущиеДанныеТаблицы.Блюдо);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЦену(Блюдо)
	
	НайтиБлюдо = Справочники.АссортиментБлюд.НайтиПоНаименованию(Блюдо, Истина);
	Возврат НайтиБлюдо.Цена;
КонецФункции 

