
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.ЦеныБлюд.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|   АссортиментБлюд.Ссылка КАК Блюдо,
		|   АссортиментБлюд.Цена КАК Цена
		|ИЗ
		|   Справочник.АссортиментБлюд КАК АссортиментБлюд";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.ЦеныБлюд.Добавить();
			НоваяСтрока.Блюдо = Выборка.Блюдо;
			НоваяСтрока.Цена = Выборка.Цена;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры
