
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИзменениеЦен.Записывать = Истина;
	
	Для Каждого ТекСтрокаБлюд Из ЦеныБлюд Цикл 
		
		Движение = Движения.ИзменениеЦен.Добавить();
		Движение.Период = (КонецМесяца(Дата) + 1);
		Движение.Блюдо = ТекСтрокаБлюд.Блюдо;
		Движение.Цена = ТекСтрокаБлюд.Цена;	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.АссортиментБлюд") Тогда
	КонецЕсли;
КонецПроцедуры
