&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;   
	ПечатьТоварногоЧека(ТабДок, ПараметрКоманды);     //СформироватьТоварныйЧекНаСервере
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТабДок", ТабДок);
	ОткрытьФорму("Документ.РегистрацияЗаказа.Форма.ФормаЧек", Параметры);
	
	
КонецПроцедуры


&НаСервере
Процедура ПечатьТоварногоЧека(ТабДок, СсылкаНаДокумент)
	
	Макет = Документы.РегистрацияЗаказа.ПолучитьМакет("Чек");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьИтого = Макет.ПолучитьОбласть("ОбластьИтого"); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияЗаказа.ВремяЗаказа КАК ВремяЗаказа,
	|	РегистрацияЗаказа.НомерСтола КАК НомерСтола,
	|	РегистрацияЗаказа.Официант КАК Официант,
	|	РегистрацияЗаказа.Номер КАК Номер,
	|	РегистрацияЗаказа.Дата КАК Дата
	|ИЗ
	|	Документ.РегистрацияЗаказа КАК РегистрацияЗаказа
	|ГДЕ
	|	РегистрацияЗаказа.Ссылка = &СсылкаНаДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияЗаказаЗаказ.НомерСтроки КАК Номер,
	|	РегистрацияЗаказаЗаказ.Блюдо КАК Блюдо,
	|	РегистрацияЗаказаЗаказ.Цена КАК Цена,
	|	РегистрацияЗаказаЗаказ.Количество КАК Количество,
	|	РегистрацияЗаказаЗаказ.Сумма КАК Сумма
	|ИЗ
	|	Документ.РегистрацияЗаказа.Заказ КАК РегистрацияЗаказаЗаказ
	|ГДЕ
	|	РегистрацияЗаказаЗаказ.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();  
	
	ДанныеШапки = РезультатЗапроса[0];
	ВыборкаШапка = ДанныеШапки.Выбрать();
	Пока ВыборкаШапка.Следующий()Цикл
		
		ДанныеСтроки = РезультатЗапроса[1];
		ВыборкаСтроки = ДанныеСтроки.Выбрать();
		
		Дата = Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy"); 
		ВремяЗаказа = Формат(ВыборкаШапка.ВремяЗаказа, "ДФ=ЧЧ:мм"); 
		
		ОбластьШапка.Параметры.НомерДокумента = ВыборкаШапка.Номер;
		ОбластьШапка.Параметры.Дата = Дата; 
		ОбластьШапка.Параметры.ВремяЗаказа = ВремяЗаказа;
		ОбластьШапка.Параметры.НомерСтола = ВыборкаШапка.НомерСтола;
		ОбластьШапка.Параметры.Официант = ВыборкаШапка.Официант;
		
		
		ТабДок.Вывести(ОбластьШапка);  
		ИтогКоличество = 0;
		ИтогСумма = 0;
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ТабДок.Вывести(ОбластьСтрока);
			
			ИтогКоличество = ИтогКоличество + ВыборкаСтроки.Количество;
			ИтогСумма = ИтогСумма + ВыборкаСтроки.Сумма;
		КонецЦикла;   	
	КонецЦикла;
	ОбластьИтого.Параметры.ИтогоСумма = ИтогСумма;
	ОбластьИтого.Параметры.ИтогоКоличество = ИтогКоличество;
	ОбластьИтого.Параметры.ИтогоСумма = ИтогСумма;
	ОбластьИтого.Параметры.ИтогоПрописью = ЧислоПрописью(ИтогСумма, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
	
	ТабДок.Вывести(ОбластьИтого);   
	
КонецПроцедуры   


