
&НаСервере
Процедура НайтиБлюдоНаСервере()
	ЭлементПоиска = Справочники.АссортиментБлюд.НайтиПоНаименованию(ТРег(Блюдо));
	
	Если ЭлементПоиска.Наименование = ТРег(Блюдо) Тогда
	
		Сообщить("Блюдо найдено!");
		КатегорияБлюда = ЭлементПоиска.КатегорияБлюда;
		ВесГотовогоБлюда = ЭлементПоиска.ВесГотовогоБлюда;
		Калорийность = ЭлементПоиска.Калорийность;
		Состав = ЭлементПоиска.Состав;
		Цена = ЭлементПоиска.Цена;
		
	Иначе      
		
		Сообщить("Блюдо необходимо добавить");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиБлюдо(Команда)
	НайтиБлюдоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьБлюдоНаСервере()
	
	ЭлементПоиска = Справочники.АссортиментБлюд.НайтиПоНаименованию(ТРег(Блюдо)); 
	
	Если Не ЭлементПоиска.Наименование = ТРег(Блюдо) Тогда  
		Справочники.АссортиментБлюд.СоздатьБлюдо(ТРег(Блюдо), КатегорияБлюда, ВесГотовогоБлюда, Состав, Калорийность, Цена);
		Сообщить("Блюдо добавлено"); 
	Иначе
		Сообщить("Блюдо уже есть в ассортименте блюд");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлюдо(Команда)
	СоздатьБлюдоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЕдИзмВес = "г.";
	ЭтаФорма.ЕдИзмК = "ккал.";
	ЭтаФорма.ЕдИзмЦ = "руб.";
КонецПроцедуры






