 Процедура СоздатьБлюдо(Блюдо, КатегорияБлюда, ВесГотовогоБлюда, Состав, Калорийность, Цена) Экспорт   
	 
	 НовоеБлюдо = СоздатьЭлемент();
	 НовоеБлюдо.Наименование = Блюдо;
	 НовоеБлюдо.КатегорияБлюда = КатегорияБлюда;
	 НовоеБлюдо.ВесГотовогоБлюда = ВесГотовогоБлюда;
	 НовоеБлюдо.Состав = Состав;
	 НовоеБлюдо.Калорийность = Калорийность;
	 НовоеБлюдо.Цена = Цена;
     НовоеБлюдо.Записать();
	 
 КонецПроцедуры
 
 Процедура Печать(ТабДок, Ссылка) Экспорт
	 
	 Макет = Справочники.АссортиментБлюд.ПолучитьМакет("Печать");
	 
	 ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	 ОбластьМенюШапка = Макет.ПолучитьОбласть("МенюШапка");
	 ОбластьМеню = Макет.ПолучитьОбласть("Меню");
	 
	 ТабДок.Очистить();
	 ТабДок.Вывести(ОбластьЗаголовок);
	 
	 ВыводШапка = Ложь;      
	 Для каждого Строка Из Перечисления.КатегорияБлюд Цикл 
		 
		 Выборка = Справочники.АссортиментБлюд.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл   
			 
			 Если Выборка.КатегорияБлюда = Строка Тогда
				 
				 Если Не ВыводШапка Тогда      //выводим шапку, если еще не вывели
					 
					 ОбластьМенюШапка.Параметры.КатегорияБлюда = Строка;
					 ТабДок.Вывести(ОбластьМенюШапка); 
					 ВыводШапка = Истина;
				 КонецЕсли; 
				 
				 ОбластьМеню.Параметры.Заполнить(Выборка);			
				 ОбластьМеню.Параметры.Блюдо =  Выборка.Наименование;				 
				 ТабДок.Вывести(ОбластьМеню);
				 
			 КонецЕсли;
			 
		 КонецЦикла; 
		 
		 ВыводШапка = Ложь; 
	 КонецЦикла; 
	 
 КонецПроцедуры
 
